docs/spec/html/topic-labeling.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0000007">1. Topic Labeling（意図ラベル）仕様（MVP+）</a>
<ul>
<li><a href="#org0000000">1.1. 目的</a></li>
<li><a href="#org0000001">1.2. データモデル</a></li>
<li><a href="#org0000002">1.3. ラベルの性質（MVP）</a></li>
<li><a href="#org0000005">1.4. 操作（コマンド案）</a>
<ul>
<li><a href="#org0000003">1.4.1. label_topics（案）</a></li>
<li><a href="#org0000004">1.4.2. list_topics（案）</a></li>
</ul>
</li>
<li><a href="#org0000006">1.5. 将来拡張</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org0000007" class="outline-2">
<h2 id="org0000007"><span class="section-number-2">1.</span> Topic Labeling（意図ラベル）仕様（MVP+）</h2>
<div class="outline-text-2" id="text-1">
<p>
このドキュメントは、Topicに付与する意図ラベル（Intent Label）を、実装に繋がる形で定義する。
MVPでは「ラベルを保存できる」ことを最小要件とし、匂わせ（Recall）への反映は後回しにできる。
</p>
</div>

<div id="outline-container-org0000000" class="outline-3">
<h3 id="org0000000"><span class="section-number-3">1.1.</span> 目的</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>ユーザーの関心単位（Topic）に対して、弱い主観メモを付与できるようにする。</li>
<li>意図ラベルは状態遷移を直接引き起こさない。</li>
</ul>
</div>
</div>

<div id="outline-container-org0000001" class="outline-3">
<h3 id="org0000001"><span class="section-number-3">1.2.</span> データモデル</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>`topic_intent_labels`
<ul class="org-ul">
<li>`topic_id` + `label` の組を一意とする（同じTopicに同じラベルを重複付与しない）</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org0000002" class="outline-3">
<h3 id="org0000002"><span class="section-number-3">1.3.</span> ラベルの性質（MVP）</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>形式: 自由記述テキスト（短文）（assumed）</li>
<li>1 Topicに複数ラベル: 許可する（`topic_id`ごとに複数行）（assumed）</li>
<li>正規化: MVPではしない（大小文字/全半角/表記ゆれは許容）（assumed）</li>
</ul>
</div>
</div>

<div id="outline-container-org0000005" class="outline-3">
<h3 id="org0000005"><span class="section-number-3">1.4.</span> 操作（コマンド案）</h3>
<div class="outline-text-3" id="text-1-4">
<p>
MVPでのコマンド提供は未確定だが、実装を見据えた契約案を置く。
</p>
</div>

<div id="outline-container-org0000003" class="outline-4">
<h4 id="org0000003"><span class="section-number-4">1.4.1.</span> label_topics（案）</h4>
<div class="outline-text-4" id="text-1-4-1">
<ul class="org-ul">
<li>目的: Topicにラベルを付ける</li>
<li>入力（案）:
<ul class="org-ul">
<li>`&#x2013;topic &lt;topic_id&gt;`（必須）</li>
<li>`&#x2013;label &lt;text&gt;`（必須）</li>
<li>`&#x2013;db &lt;path&gt;`（任意）</li>
</ul></li>
<li>出力: 人間向けテキスト（成功/失敗）</li>
</ul>

<p>
例:
</p>

<p>
```bash
label_topics &#x2013;topic 4a0d&#x2026; &#x2013;label '気になる'
```
</p>
</div>
</div>

<div id="outline-container-org0000004" class="outline-4">
<h4 id="org0000004"><span class="section-number-4">1.4.2.</span> list_topics（案）</h4>
<div class="outline-text-4" id="text-1-4-2">
<ul class="org-ul">
<li>目的: ラベル付与のためにTopicを列挙する（Scoped Revealの一形態）</li>
<li>入力（案）:
<ul class="org-ul">
<li>`&#x2013;content &lt;content_id&gt;` または `&#x2013;host &lt;url_host&gt;`</li>
<li>`&#x2013;db &lt;path&gt;`（任意）</li>
</ul></li>
<li>出力（例）:
<ul class="org-ul">
<li>`topic_id | ordinal | text`</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org0000006" class="outline-3">
<h3 id="org0000006"><span class="section-number-3">1.5.</span> 将来拡張</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>固定語彙（プリセット）の導入</li>
<li>ラベルの匂わせ反映（Shelf一覧で分布だけ表示）</li>
<li>ラベルによる再遭遇（Recall）の起点化（ただし状態遷移はしない）</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
